kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
  delay_init(168U);
  init_status = eeprom_config_store_init(&store);
  debug_uart_puts("[board-a] eeprom init=");
  debug_write_u32((uint32_t)init_status);

  if (init_status == CONFIG_STORE_OK) {
    load_status = config_store_load(&store, payload, sizeof(payload), &metadata);
    debug_uart_puts(" load=");
    debug_write_u32((uint32_t)load_status);
    debug_uart_puts(" slot=");
    debug_write_u32(metadata.selected_slot);
    debug_uart_puts(" seq=");
    debug_write_u32(metadata.sequence);
  }

  debug_uart_puts("\r\n");
}

static void timer_init(void)
{
  RCC_ClocksTypeDef clocks;
  TIM_TimeBaseInitTypeDef timer;
  uint32_t timer_clock;
  uint16_t prescaler;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
  RCC_GetClocksFreq(&clocks);

  timer_clock = clocks.PCLK1_Frequency;
  if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1) {
    timer_clock *= 2U;
  }

  prescaler = (uint16_t)((timer_clock / 1000000U) - 1U);
  TIM_TimeBaseStructInit(&timer);
  timer.TIM_Prescaler = prescaler;
  timer.TIM_CounterMode = TIM_CounterMode_Up;
  timer.TIM_Period = 0xFFFFFFFFU;
  timer.TIM_ClockDivision = TIM_CKD_DIV1;
  timer.TIM_RepetitionCounter = 0U;
  TIM_TimeBaseInit(TIM2, &timer);
  TIM_SetCounter(TIM2, 0U);
  TIM_Cmd(TIM2, ENABLE);

  board_a_monotonic_init(&g_monotonic, TIM2->CNT);
}

static uint64_t board_a_rtos_now_us(void *context)
{
  uint32_t raw_us;
  uint32_t previous_raw_us;
  uint64_t now_us;

  (void)context;
  taskENTER_CRITICAL();
  raw_us = TIM2->CNT;
  previous_raw_us = g_monotonic.last_raw_us;
  if (g_monotonic.initialized &&
      ((uint32_t)(raw_us - previous_raw_us) >
       BOARD_A_MONOTONIC_MAX_GAP_US)) {
    g_board_a_rtos_diag.fault_flags |= BOARD_A_FAULT_MONOTONIC_GAP;
  }
  now_us = board_a_monotonic_update(&g_monotonic, raw_us);
  if (g_monotonic.initialized && (raw_us < previous_raw_us)) {
    g_board_a_rtos_diag.monotonic_wrap_count++;
  }
  taskEXIT_CRITICAL();
  return now_us;
}

static bool model_lock(void *context)
{
  (void)context;
  if (xSemaphoreTake(g_model_mutex, portMAX_DELAY) != pdTRUE) {
    return false;
  }
  g_model_lock_started_us = TIM2->CNT;
  return true;
}

static void model_unlock(void *context)
{
  uint32_t elapsed_us = (uint32_t)(TIM2->CNT - g_model_lock_started_us);

  (void)context;
  if (elapsed_us > g_board_a_rtos_diag.model_lock_max_us) {
    g_board_a_rtos_diag.model_lock_max_us = elapsed_us;
  }
  xSemaphoreGive(g_model_mutex);
}

static const board_a_runtime_ops_t g_runtime_ops = {
  model_lock,
  model_unlock,
  board_a_rtos_now_us
};

/*
 * Board A uses TIM2 for microsecond delays, not SysTick. The production
 * soft-I2C init runs before the scheduler, so report readiness from the
 * actual delay backend instead of the legacy SysTick check.
 */
bool soft_i2c_platform_ready(void)
{
  return ((RCC->APB1ENR & RCC_APB1ENR_TIM2EN) != 0U) &&
         ((TIM2->CR1 & TIM_CR1_CEN) != 0U);
}

static void rs485_init(void)
{
  GPIO_InitTypeDef gpio;
  USART_InitTypeDef usart;
  NVIC_InitTypeDef nvic;

  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                         RCC_AHB1Periph_GPIOG, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
  gpio.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
  gpio.GPIO_Mode = GPIO_Mode_AF;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOA, &gpio);

  gpio.GPIO_Pin = GPIO_Pin_8;
  gpio.GPIO_Mode = GPIO_Mode_OUT;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOG, &gpio);
  GPIO_ResetBits(GPIOG, GPIO_Pin_8);

  usart.USART_BaudRate = BOARD_A_RS485_BAUD;
  /*
   * STM32F4 parity occupies the ninth transmitted bit. The 8 data bits plus
   * even parity therefore require WordLength_9b in the peripheral config.
   */
  usart.USART_WordLength = USART_WordLength_9b;
  usart.USART_StopBits = USART_StopBits_1;
  usart.USART_Parity = USART_Parity_Even;
  usart.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  usart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_Init(USART2, &usart);

  USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);
  USART_ITConfig(USART2, USART_IT_ERR, DISABLE);
  USART_ITConfig(USART2, USART_IT_PE, DISABLE);
  USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
  USART_ITConfig(USART2, USART_IT_TC, DISABLE);
  USART_ClearFlag(USART2, USART_FLAG_TC);

  /*
   * All four implemented priority bits are preemption bits. This gives a
   * single, explicit mapping for the FreeRTOS BASEPRI threshold and keeps
   * USART2 at or below configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY.
   */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
  nvic.NVIC_IRQChannel = USART2_IRQn;
  nvic.NVIC_IRQChannelPreemptionPriority =
      BOARD_A_USART2_PREEMPTION_PRIORITY;
  nvic.NVIC_IRQChannelSubPriority = 0U;
  nvic.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&nvic);

  USART_Cmd(USART2, ENABLE);
}

static void rs485_enable_rx_interrupt(void)
{
  USART_ClearFlag(USART2, USART_FLAG_ORE | USART_FLAG_FE |
                           USART_FLAG_NE | USART_FLAG_PE);
  USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
  USART_ITConfig(USART2, USART_IT_ERR, ENABLE);
  USART_ITConfig(USART2, USART_IT_PE, ENABLE);
}

static void record_rx_fault(uint32_t timestamp_us, bool uart_error)
{
  g_rx_fault_us = timestamp_us;
  g_rx_fault_epoch++;
  if (uart_error) {
    g_board_a_rtos_diag.rx_continuity_errors++;
  }
}

static void rx_isr(void)
{
  uint32_t sr = USART2->SR;
  uint32_t timestamp_us = TIM2->CNT;
  uint32_t error_flags = sr & (USART_FLAG_ORE | USART_FLAG_FE |
                               USART_FLAG_NE | USART_FLAG_PE);
  bool received = (sr & USART_FLAG_RXNE) != 0U;
  uint16_t data = 0U;
  BaseType_t higher_priority_task_woken = pdFALSE;

  if (received || (error_flags != 0U)) {
    data = (uint16_t)USART2->DR;
  }

  if (error_flags != 0U) {
    g_board_a_rtos_diag.uart_error_flags |= error_flags;
    record_rx_fault(timestamp_us, true);
  }

  if (received) {
    board_a_rx_event_t event;

