kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
    event.byte = (uint8_t)data;
    event.timestamp_us = timestamp_us;
    event.flags = error_flags;
    if (xQueueSendFromISR(g_rx_queue, &event,
                          &higher_priority_task_woken) != pdPASS) {
      g_board_a_rtos_diag.rx_queue_drops++;
      record_rx_fault(timestamp_us, false);
    }
  }

  if ((sr & USART_SR_TXE) != 0U &&
      (USART2->CR1 & USART_CR1_TXEIE) != 0U) {
    uint8_t byte = 0U;

    if (board_a_tx_on_txe(&g_tx, &byte)) {
      USART2->DR = (uint16_t)byte;
    }
    if (g_tx.state == BOARD_A_TX_WAIT_TC) {
      USART2->CR1 &= (uint16_t)~USART_CR1_TXEIE;
      USART2->CR1 |= USART_CR1_TCIE;
    } else if (g_tx.state != BOARD_A_TX_SENDING) {
      USART2->CR1 &= (uint16_t)~USART_CR1_TXEIE;
    }
  }

  if ((sr & USART_SR_TC) != 0U &&
      (USART2->CR1 & USART_CR1_TCIE) != 0U) {
    USART2->CR1 &= (uint16_t)~USART_CR1_TCIE;
    if (board_a_tx_on_tc(&g_tx)) {
      GPIO_ResetBits(GPIOG, GPIO_Pin_8);
      g_board_a_rtos_diag.tx_completions++;
      if (g_comm_task != NULL) {
        vTaskNotifyGiveFromISR(g_comm_task, &higher_priority_task_woken);
      }
    }
  }

  portYIELD_FROM_ISR(higher_priority_task_woken);
}

void USART2_IRQHandler(void)
{
  rx_isr();
}

static void tx_abort_hardware(void)
{
  taskENTER_CRITICAL();
  USART2->CR1 &= (uint16_t)~(USART_CR1_TXEIE | USART_CR1_TCIE);
  board_a_tx_abort(&g_tx);
  GPIO_ResetBits(GPIOG, GPIO_Pin_8);
  taskEXIT_CRITICAL();
}

static bool tx_send(const uint8_t *data, uint16_t length)
{
  uint32_t wire_time_us;
  uint32_t budget_us;
  uint32_t start_us;
  uint32_t notification_value;
  uint32_t status;
  uint8_t first_byte;

  if ((data == NULL) || (length == 0U)) {
    return false;
  }

  wire_time_us = ((uint32_t)length * 11U * 1000000U) / BOARD_A_RS485_BAUD;
  budget_us = wire_time_us + 100000U;

  (void)ulTaskNotifyTake(pdTRUE, 0U);
  taskENTER_CRITICAL();
  USART2->CR1 &= (uint16_t)~(USART_CR1_TXEIE | USART_CR1_TCIE);
  status = USART2->SR;
  if (((status & USART_SR_TXE) == 0U) ||
      ((status & (USART_FLAG_ORE | USART_FLAG_FE |
                  USART_FLAG_NE | USART_FLAG_PE)) != 0U)) {
    GPIO_ResetBits(GPIOG, GPIO_Pin_8);
    taskEXIT_CRITICAL();
    return false;
  }
  start_us = TIM2->CNT;
  if (!board_a_tx_start(&g_tx, data, length, start_us, budget_us)) {
    taskEXIT_CRITICAL();
    return false;
  }
  GPIO_SetBits(GPIOG, GPIO_Pin_8);
  /*
   * TC is cleared by reading SR and writing DR. Prime the first byte here,
   * which both starts this frame and clears any TC left by the previous one.
   */
  if (!board_a_tx_on_txe(&g_tx, &first_byte)) {
    board_a_tx_abort(&g_tx);
    GPIO_ResetBits(GPIOG, GPIO_Pin_8);
    taskEXIT_CRITICAL();
    return false;
  }
  USART2->DR = (uint16_t)first_byte;
  if (g_tx.state == BOARD_A_TX_WAIT_TC) {
    USART2->CR1 |= USART_CR1_TCIE;
  } else {
    USART2->CR1 |= USART_CR1_TXEIE;
  }
  taskEXIT_CRITICAL();

  for (;;) {
    uint32_t elapsed_us;
    uint32_t remaining_us;
    TickType_t wait_ticks;

    taskENTER_CRITICAL();
    if (board_a_tx_take_completion(&g_tx)) {
      taskEXIT_CRITICAL();
      return true;
    }
    if (board_a_tx_poll_timeout(&g_tx, TIM2->CNT)) {
      USART2->CR1 &= (uint16_t)~(USART_CR1_TXEIE | USART_CR1_TCIE);
      GPIO_ResetBits(GPIOG, GPIO_Pin_8);
      (void)board_a_tx_take_timeout(&g_tx);
      g_board_a_rtos_diag.tx_timeouts++;
      taskEXIT_CRITICAL();
      return false;
    }
    if (!board_a_tx_is_active(&g_tx)) {
      taskEXIT_CRITICAL();
      tx_abort_hardware();
      return false;
    }

    elapsed_us = (uint32_t)(TIM2->CNT - start_us);
    remaining_us = (elapsed_us < budget_us) ? (budget_us - elapsed_us) : 0U;
    taskEXIT_CRITICAL();

    wait_ticks = pdMS_TO_TICKS((remaining_us + 999U) / 1000U);
    if (wait_ticks == 0U) {
      wait_ticks = 1U;
    }
    (void)xTaskNotifyWait(0U, 0xFFFFFFFFUL, &notification_value,
                          wait_ticks);
  }
}

static void service_rx_fault(void)
{
  uint32_t epoch;
  uint32_t fault_us;

  taskENTER_CRITICAL();
  epoch = g_rx_fault_epoch;
  fault_us = g_rx_fault_us;
  taskEXIT_CRITICAL();

  if (epoch != g_rx_fault_epoch_seen) {
    g_rx_fault_epoch_seen = epoch;
    board_a_rx_recovery_begin(&g_rx_recovery, fault_us);
    modbus_rtu_rx_discard(&g_runtime.slave.receiver);
  }
}

static bool rx_queue_empty_and_sample(uint32_t *now_us, uint32_t *fault_epoch)
{
  bool empty;

  taskENTER_CRITICAL();
  empty = uxQueueMessagesWaiting(g_rx_queue) == 0U;
  if (empty) {
    *fault_epoch = g_rx_fault_epoch;
    *now_us = (uint32_t)board_a_rtos_now_us(NULL);
  }
  taskEXIT_CRITICAL();
  return empty;
}

static void process_rx_event(const board_a_rx_event_t *event)
{
  if (event->flags != 0U) {
    if (!board_a_rx_recovery_is_discarding(&g_rx_recovery)) {
      board_a_rx_recovery_begin(&g_rx_recovery, event->timestamp_us);
      modbus_rtu_rx_discard(&g_runtime.slave.receiver);
    }
    return;
  }

  if (!board_a_rx_recovery_accept(&g_rx_recovery, event->timestamp_us)) {
    return;
  }

  board_a_runtime_push_byte(&g_runtime, event->byte, event->timestamp_us);
}

static void debug_status(uint64_t now_us)
{
  board_a_runtime_status_t status;

  if (!board_a_log_schedule_due(&g_log_schedule, now_us)) {
    return;
  }
  if (!board_a_runtime_copy_status(&g_runtime, &status)) {
    return;
  }

  debug_uart_puts("[board-a] run=");
  debug_write_u32(status.run_state);
  debug_uart_puts(" records=");
  debug_write_u32(status.sequence);
  debug_uart_puts(" rx=");
  debug_write_u32(status.stats.rx_frames);
  debug_uart_puts(" crc=");
  debug_write_u32(status.stats.crc_errors);
  debug_uart_puts(" tx=");
  debug_write_u32(status.stats.tx_responses);
  debug_uart_puts(" qdrop=");
  debug_write_u32(g_board_a_rtos_diag.rx_queue_drops);
  debug_uart_puts(" uerr=");
  debug_write_u32(g_board_a_rtos_diag.uart_error_flags);
  debug_uart_puts(" txto=");
  debug_write_u32(g_board_a_rtos_diag.tx_timeouts);
  debug_uart_puts("\r\n");
}

static void comm_task(void *argument)
{
  board_a_rx_event_t event;
  size_t response_length;
  uint32_t now_us;
  uint32_t poll_epoch;
  bool scheduling_state_changed;

  (void)argument;
  taskENTER_CRITICAL();
  g_board_a_rtos_diag.task_ready_mask |= 1U << 0;
  taskEXIT_CRITICAL();
  rs485_enable_rx_interrupt();

