kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
  for (;;) {
    UBaseType_t queue_depth;

    service_rx_fault();
    queue_depth = uxQueueMessagesWaiting(g_rx_queue);
    if (queue_depth > g_board_a_rtos_diag.rx_queue_depth_max) {
      g_board_a_rtos_diag.rx_queue_depth_max = queue_depth;
    }
    if (xQueueReceive(g_rx_queue, &event, pdMS_TO_TICKS(5)) == pdPASS) {
      do {
        process_rx_event(&event);
        service_rx_fault();
      } while (xQueueReceive(g_rx_queue, &event, 0U) == pdPASS);
      continue;
    }

    if (!rx_queue_empty_and_sample(&now_us, &poll_epoch)) {
      continue;
    }
    if ((g_rx_fault_epoch != g_rx_fault_epoch_seen) ||
        (g_rx_fault_epoch != poll_epoch)) {
      service_rx_fault();
      continue;
    }
    if (!board_a_rx_recovery_can_poll(&g_rx_recovery, now_us)) {
      continue;
    }

    response_length = board_a_runtime_poll_observe(
        &g_runtime, now_us, g_response, sizeof(g_response),
        &scheduling_state_changed);
    if (scheduling_state_changed) {
      xTaskNotifyGive(g_acquisition_task);
    }
    if (response_length != 0U) {
      (void)tx_send(g_response, (uint16_t)response_length);
    }
    debug_status(board_a_rtos_now_us(NULL));
    g_board_a_rtos_diag.comm_stack_min_words =
        uxTaskGetStackHighWaterMark(NULL);
  }
}

/*
 * The acquisition task waits for the earliest pending deadline: the next
 * periodic sample while running, or the latched scheduled-start deadline while
 * armed. The wait is capped at one second so the TIM2 monotonic service keeps
 * extending even when no deadline is near.
 */
static uint32_t acquisition_wait_ms(const board_a_runtime_status_t *status,
                                    uint64_t now_us)
{
  uint64_t earliest_us = 0U;
  uint64_t remaining_us;
  bool have_deadline = false;

  if (status->run_state == BOARD_A_RUN_RUNNING) {
    if (status->start_pending || (status->next_sample_us == 0U)) {
      return 0U;
    }
    earliest_us = status->next_sample_us;
    have_deadline = true;
  }

  if (status->schedule_armed &&
      (!have_deadline || (status->schedule_deadline_us < earliest_us))) {
    earliest_us = status->schedule_deadline_us;
    have_deadline = true;
  }

  if (!have_deadline) {
    return BOARD_A_MAX_WAIT_MS;
  }
  if (earliest_us <= now_us) {
    return 0U;
  }

  remaining_us = earliest_us - now_us;
  if (remaining_us > (uint64_t)BOARD_A_MAX_WAIT_MS * 1000ULL) {
    return BOARD_A_MAX_WAIT_MS;
  }
  return (uint32_t)((remaining_us + 999ULL) / 1000ULL);
}

static void acquisition_task(void *argument)
{
  board_a_runtime_status_t status;
  uint32_t wait_ms;
  uint32_t notification_value;

  (void)argument;
  taskENTER_CRITICAL();
  g_board_a_rtos_diag.task_ready_mask |= 1U << 1;
  taskEXIT_CRITICAL();

  for (;;) {
    uint64_t now_us = board_a_rtos_now_us(NULL);
    board_a_runtime_status_t before_tick;

    if (board_a_runtime_copy_status(&g_runtime, &before_tick) &&
        (before_tick.run_state == BOARD_A_RUN_RUNNING) &&
        !before_tick.start_pending &&
        (before_tick.next_sample_us != 0U) &&
        (now_us >= before_tick.next_sample_us)) {
      uint32_t late_us =
          (uint32_t)(now_us - before_tick.next_sample_us);

      if (late_us > g_board_a_rtos_diag.schedule_late_max_us) {
        g_board_a_rtos_diag.schedule_late_max_us = late_us;
      }
    }

    board_a_runtime_tick(&g_runtime, now_us);
    if (!board_a_runtime_copy_status(&g_runtime, &status)) {
      wait_ms = BOARD_A_MAX_WAIT_MS;
    } else {
      if (status.schedule_start_late_us >
          g_board_a_rtos_diag.schedule_start_late_max_us) {
        g_board_a_rtos_diag.schedule_start_late_max_us =
            status.schedule_start_late_us;
      }
      g_board_a_rtos_diag.schedule_start_count =
          status.schedule_start_count;
      wait_ms = acquisition_wait_ms(&status, now_us);
    }

    (void)xTaskNotifyWait(0U, 0xFFFFFFFFUL, &notification_value,
                          pdMS_TO_TICKS(wait_ms));
    (void)notification_value;
    taskENTER_CRITICAL();
    g_board_a_rtos_diag.acquisition_stack_min_words =
        uxTaskGetStackHighWaterMark(NULL);
    taskEXIT_CRITICAL();
  }
}

static void create_runtime_objects(void)
{
  g_model_mutex = xSemaphoreCreateMutexStatic(&g_model_mutex_buffer);
  g_rx_queue = xQueueCreateStatic(BOARD_A_RX_QUEUE_CAPACITY,
                                  sizeof(board_a_rx_event_t),
                                  (uint8_t *)g_rx_queue_storage,
                                  &g_rx_queue_buffer);
  if ((g_model_mutex == NULL) || (g_rx_queue == NULL)) {
    board_a_rtos_fatal(BOARD_A_FAULT_TASK_CREATE);
  }

  g_comm_task = xTaskCreateStatic(
      comm_task, "comm", BOARD_A_COMM_STACK_WORDS, NULL,
      BOARD_A_COMM_TASK_PRIORITY, g_comm_stack, &g_comm_task_buffer);
  g_acquisition_task = xTaskCreateStatic(
      acquisition_task, "acq", BOARD_A_ACQUISITION_STACK_WORDS, NULL,
      BOARD_A_ACQUISITION_TASK_PRIORITY, g_acquisition_stack,
      &g_acquisition_task_buffer);
  if ((g_comm_task == NULL) || (g_acquisition_task == NULL)) {
    board_a_rtos_fatal(BOARD_A_FAULT_TASK_CREATE);
  }

  g_board_a_rtos_diag.rx_queue_item_size = sizeof(board_a_rx_event_t);
  board_a_runtime_init(&g_runtime, 1U, &g_runtime_ops, NULL);
}

int board_a_rtos_run(void)
{
  timer_init();
  debug_uart_init(DEBUG_UART_BAUD);
  debug_uart_puts("\r\n[board-a] Modbus RTU slave / FreeRTOS\r\n");
  debug_uart_puts("[board-a] addr=1 uart=USART2 PA2/PA3 PG8 9600 8E1\r\n");
  debug_uart_puts("[board-a] debug=USART1 PA9/PA10 115200 8N1\r\n");

  board_a_tx_init(&g_tx);
  board_a_rx_recovery_init(&g_rx_recovery, BOARD_A_T35_US);
  board_a_log_schedule_init(&g_log_schedule, BOARD_A_LOG_PERIOD_US, 0U);
  create_runtime_objects();
  rs485_init();
  eeprom_diag_init();

  debug_uart_puts("[board-a] scheduler starting\r\n");
  vTaskStartScheduler();

  board_a_rtos_fatal(BOARD_A_FAULT_SCHEDULER_RETURNED);
  return 0;
}
